tests/Cases/Case-mmcClouds/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101300; 

boundaryField
{
    inletFuel
    {
        type            zeroGradient;
    }

    pilot
    {
        type            zeroGradient;
    }

    inletCoflow
    {
        type            zeroGradient;
    }
    
    side
    {
        type            waveTransmissive;
        gamma           1.3;
        fieldInf        101300;
        lInf            0.3;
        value           uniform 101300;
    }

    outlet
    {
        type            waveTransmissive;
        gamma           1.3;
        fieldInf        100000;
        lInf            0.3;
        value           uniform 101300;
    }
}


// ************************************************************************* //
