tests/Cases/Case-mmcClouds/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.767;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }
    side
    {
        type            inletOutlet;
        inletValue      uniform 0.767;
        value           uniform 0.767;
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform 0.767;
    }
    inletFuel
    {
        type            fixedValue;
        value           uniform 0.647;
    }
    pilot
    {
        type            calculated;
        //        value           uniform 0.734;
        value           uniform 0.742;
    }
}


// ************************************************************************* //
