tests/Cases/Case-mmcClouds/0/itvInflowU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    side
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    inletCoflow
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0.9);
        value           uniform (0 0 0.9);
    }

    inletFuel
    {
        type            inletOutlet;
        inletValue      uniform (0 0 49.6);
        value           uniform (0 0 49.6);
    }

    pilot
    {
        type            inletOutlet;
        inletValue      uniform (0 0 11.4);
        value           uniform (0 0 11.4);
    }
}


// ************************************************************************* //
