tests/Cases/Case-mmcClouds/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      muSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletFuel
    {
        type            zeroGradient;
    }

    pilot
    {
        type            zeroGradient;
    }

    inletCoflow
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    side
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
